Repository: kansasdev/QRBarcode
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: pl_pl

# About
source: About app
pl_pl: O programie

# AboutDetails
source: Application for scanning QR codes in Windows environment. It contains functionality of decoding COVID-19 health certificates (vaccine, recovery, test). Application WON'T STORE AND SEND ANYWHERE COLLECTED DATA. If you want scan certificate, put QR code in front of selected camera and wait for reading. Results are displayed in History tab. During reading of health certificate verification of issuer is being checked (green - HC issued by trusted issuer, yellow - unknown issuer, red - error while checking integrity of HC)
pl_pl: Aplikacja do skanowania kodów QR w środowisku Windows. Zawiera możliwość dekodowania kodów QR certyfikatów zdrowia COVID-19 związanych ze szczepieniem. Ta aplikacja NIE PRZECHOWUJE ANI NIE PRZESYŁA NIGDZIE przetwarzanych informacji - w celu użycia skieruj certyfikat w stronę kamery, po czym nastąpi odczyt i zdekodowanie. Wyniki będą dostępne w zakładce "Historia".

# AboutDetails2
source: During development github repositories shared by Digital Health Certificate EU were used, especially packet hcert-dotnet under Apache-2.0 license. Health certificates are digitally verified against repository of public keys available at one of selected github project to ensure they were issued by trusted authority
pl_pl: Podczas prac nad programem skorzystano ze zbiorów github udostępnianych przez grupę pracującą nad Digital Health Certificate EU - w szczególności pakiet hcert-dotnet udostępniony na licencji Apache-2.0

# AppSubtitle
source: Scanning QR codes and decoding health certificates
pl_pl: Skanowanie QR kodów, dekodowanie

# BackButtonContent
source: Back
pl_pl: Powrót

# CzyscButtonContent
source: Clean
pl_pl: Czyść

# DecodeHCOption
source: Decoding health certificate
pl_pl: Dekodowanie certyfikatu zdrowia

source: Error:
pl_pl: Błąd:

# ErrorEmptyCertificates
source: Empty public keys dictionary for verifying health certificates
pl_pl: Pusty słownik publicznych kluczy do weryfikacji certyfikatów zdrowia

# HCAuthorityDetails
source: Authority responsible for health certificate
pl_pl: Urząd odpowiedzialny za certyfikat

# HCCountry
source: Country
pl_pl: Kraj

# HCDateOfBirth
source: Date of birth
pl_pl: Data urodzenia

# HCDateOfVaccine
source: Date of vaccination
pl_pl: Data szczepienia

# HCDisease
source: Disease
pl_pl: Choroba

# HCDoseNumber
source: Dose
pl_pl: Dawka

# HCFirstPositiveTestDate
source: Date of positive result
pl_pl: Data wyniku pozytywnego

# HCGivenName
source: First name
pl_pl: Imie

# HCGivenNameMRZ
source: First name (passport)
pl_pl: Imie paszport

# HCIdentifier
source: Health certificate identifier
pl_pl: Identyfikatu certyfikatu zdrowia

# HCIssuingAuthority
source: Issuer of health certificate
pl_pl: Wystawca certyfikatu zdrowia

# HCLastName
source: Surname
pl_pl: Nazwisko

# HCLastNameMRZ
source: Surname (passport)
pl_pl: Nazwisko paszport

# HCMedicalProduct
source: Medical product
pl_pl: Wyrób medyczny

# HCProducer
source: Producer
pl_pl: Producent

# HCRecoveryValidFrom
source: Date of recovery
pl_pl: Data zakończenia choroby

# HCRecoveryValidTo
source: Valid to
pl_pl: Data ważności

# HCTestCentre
source: Test centre
pl_pl: Centrum testów

# HCTestDate
source: Test date
pl_pl: Data testu

# HCTestResult
source: Test result
pl_pl: Wynik testu

# HCTestType
source: Test type
pl_pl: Rodzaj testu

# HCTotalDoses
source: Total doses required
pl_pl: Wymagana ilość dawek

# HCVaccine
source: Vaccine
pl_pl: Szczepionka

source: History
pl_pl: Historia

# Info
source: App for scanning QR codes in Windows. It contains implementation of digital health certificate decoding and verifying. ANY DATA ARE STORED NOR SEND ANYWHERE.
pl_pl: Program do skanowania kodów QR w systemie Windows. Zawiera implementację kodów QR zaszczepionych. ŻADNE DANE NIE SĄ PRZECHOWYWANE I NIGDZIE NIE SĄ WYSYŁANE

# NoScannerFoundException
source: No scanning device. It might be regular Full HD camera
pl_pl: Brak urządzenia skanującego. To może być zwykła kamera

# RecoveryTitle
source: Certificate of recovery
pl_pl: Certyfikat ozdrowieńca

source: Scan
pl_pl: Skanowanie

# ScanDecoded
source: Decoded QR
pl_pl: Postać zdekodowana QR:

# ScanUndecoded
source: Raw QR code
pl_pl: Postać surowa kodu QR:

source: Separate window view?
pl_pl: Osobne okienko podglądu?

# SettingsScanners
source: Scanners available
pl_pl: Dostępne skanery kodów QR

# SettingsTitle
source: QRBarcode settings
pl_pl: Ustawienia aplikacji QRBarcode

# TestTitle
source: Certificate of test
pl_pl: Certyfikat testu

# VaccineTitle
source: Certificate of vaccine
pl_pl: Certyfikat szczepienia
